package projectmovie;

public class Prompt {
   
   public void Prompt_main() {      // 사용자모드 첫화면
      String prompt = """
            =====================================================
                  << Jump to Moon >>
               
               1. 영화예매
               2. 예매확인
               3. 예매취소
               4. 회원가입하기
               5. 종료하기
               
            =====================================================
            번호를 입력해주세요: """;
      System.out.println(prompt);
   }
   
   public void Prompt_manager() {      // 관리자모드 첫화면
      String prompt = """
            =====================================================
                  << 영화 예매 관리 프로그램 >>
               
               1. 영화등록
               2. 영화 삭제하기
               3. 상영시간표 등록
               4. 상영시간표 삭제
               5. 영화 목록 보기
               6. 회원 목록 보기
               7. 예매율 확인
               8. 첫 화면으로 돌아가기
               
            =====================================================
            번호를 입력해주세요: """;
      System.out.println(prompt);
   }
   
   
   public void Prompt_main_Reserv() {      // 사용자 - 1
      String prompt = """
            =====================================================
                  << 영화예매 >>
               
               1. 영화예매
               2. 예매확인
               3. 예매취소
               4. 회원가입하기
               5. 종료하기
               
            =====================================================
            """;
      System.out.println(prompt);
   }

   public void Prompt_main_CheckReserv() {      // 사용자 - 2
      String prompt = """
            =====================================================
                  << 예매확인 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_main_cancelTicket() {      // 사용자 - 3
      String prompt = """
            =====================================================
                  << 예매취소 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_main_RegiMember() {      // 사용자 - 4
      String prompt = """
            =====================================================
                  << 회원가입 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   // ==============================================================================================
   
   public void Prompt_manager_RegiMovie( ) {      // 관리자 - 1
      String prompt = """
            =====================================================
                  << 영화등록 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_manager_Del( ) {      // 관리자 - 2
      String prompt = """
            =====================================================
                  << 영화삭제 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_manager_NMT() {      // 관리자 - 3
      String prompt = """
            =====================================================
                  << 상영시간표 등록 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_manager_delNMT( ) {      // 관리자 - 4
      String prompt = """
            =====================================================
                  << 상영시간표 삭제 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_manager_MovieList( ) {      // 관리자 - 5
      String prompt = """
            =====================================================
                  << 영화 목록 보기 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_manager_ConsumerList( ) {      // 관리자 - 6
      String prompt = """
            =====================================================
                  << 회원 목록 보기 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
   public void Prompt_manager_RRTotal( ) {      // 관리자 - 7
      String prompt = """
            =====================================================
                  << 예매율 확인 >>
            =====================================================
            """;
      System.out.println(prompt);
   }
   
}